; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s4-p20-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 t5 t6 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 l3-0 l3-1 l3-2 l3-3 l4-0 l4-1 l4-2 l4-3 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (TRUCK t6)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (at t0 l0-3)
    (at t1 l1-2)
    (at t2 l2-3)
    (at t3 l3-1)
    (at t4 l4-2)
    (at t5 l4-1)
    (at t6 l1-2)
    (at p0 l1-1)
    (at p1 l4-2)
    (at p2 l0-1)
    (at p3 l1-1)
    (at p4 l0-3)
    (at p5 l4-1)
    (at p6 l2-1)
    (at p7 l0-3)
    (at p8 l3-0)
    (at p9 l2-0)
    (at p10 l2-1)
    (at p11 l0-3)
    (at p12 l3-0)
    (at p13 l3-0)
    (at p14 l4-3)
    (at p15 l4-2)
    (at p16 l1-0)
    (at p17 l1-1)
    (at p18 l4-0)
    (at p19 l4-3)
    (at a0 l0-0)
    (at a1 l2-0)
    (at a2 l0-0)
)
(:goal
    (and
        (at p0 l4-3)
        (at p1 l0-0)
        (at p2 l3-3)
        (at p3 l4-0)
        (at p4 l2-1)
        (at p5 l3-0)
        (at p6 l0-0)
        (at p7 l0-2)
        (at p8 l3-1)
        (at p9 l2-2)
        (at p10 l1-1)
        (at p11 l3-0)
        (at p12 l4-0)
        (at p13 l2-3)
        (at p14 l2-0)
        (at p15 l2-0)
        (at p16 l2-3)
        (at p17 l0-0)
        (at p18 l2-0)
        (at p19 l2-3)
    )
)

  (:constraints
    (and
      (always (not (in p7 a0)))
      (always (not (in p7 a1)))
      (always (not (in p7 a2)))
      (always (not (in p8 a0)))
      (always (not (in p8 a1)))
      (always (not (in p8 a2)))
      (always (not (in p9 a0)))
      (always (not (in p9 a1)))
      (always (not (in p9 a2)))
    )
  )
)

; plan
1. (load-truck p5 t5 l4-1)
   deleted: (at p5 l4-1)
   added: (in p5 t5)
   goals met: 0 of 20
2. (load-truck p15 t4 l4-2)
   deleted: (at p15 l4-2)
   added: (in p15 t4)
   goals met: 0 of 20
3. (load-truck p1 t4 l4-2)
   deleted: (at p1 l4-2)
   added: (in p1 t4)
   goals met: 0 of 20
4. (load-truck p7 t0 l0-3)
   deleted: (at p7 l0-3)
   added: (in p7 t0)
   goals met: 0 of 20
5. (load-truck p4 t0 l0-3)
   deleted: (at p4 l0-3)
   added: (in p4 t0)
   goals met: 0 of 20
6. (load-truck p11 t0 l0-3)
   deleted: (at p11 l0-3)
   added: (in p11 t0)
   goals met: 0 of 20
7. (drive-truck t3 l3-1 l3-0 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-0)
   goals met: 0 of 20
8. (drive-truck t2 l2-3 l2-1 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-1)
   goals met: 0 of 20
9. (drive-truck t1 l1-2 l1-1 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 0 of 20
10. (drive-truck t6 l1-2 l1-1 c1)
   deleted: (at t6 l1-2)
   added: (at t6 l1-1)
   goals met: 0 of 20
11. (fly-airplane a2 l0-0 l4-0)
   deleted: (at a2 l0-0)
   added: (at a2 l4-0)
   goals met: 0 of 20
12. (drive-truck t5 l4-1 l4-0 c4)
   deleted: (at t5 l4-1)
   added: (at t5 l4-0)
   goals met: 0 of 20
13. (drive-truck t4 l4-2 l4-3 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-3)
   goals met: 0 of 20
14. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 0 of 20
15. (load-truck p8 t3 l3-0)
   deleted: (at p8 l3-0)
   added: (in p8 t3)
   goals met: 0 of 20
16. (load-truck p6 t2 l2-1)
   deleted: (at p6 l2-1)
   added: (in p6 t2)
   goals met: 0 of 20
17. (load-truck p10 t2 l2-1)
   deleted: (at p10 l2-1)
   added: (in p10 t2)
   goals met: 0 of 20
18. (load-truck p3 t1 l1-1)
   deleted: (at p3 l1-1)
   added: (in p3 t1)
   goals met: 0 of 20
19. (load-truck p17 t1 l1-1)
   deleted: (at p17 l1-1)
   added: (in p17 t1)
   goals met: 0 of 20
20. (load-truck p0 t1 l1-1)
   deleted: (at p0 l1-1)
   added: (in p0 t1)
   goals met: 0 of 20
21. (load-airplane p18 a2 l4-0)
   deleted: (at p18 l4-0)
   added: (in p18 a2)
   goals met: 0 of 20
22. (unload-truck p5 t5 l4-0)
   deleted: (in p5 t5)
   added: (at p5 l4-0)
   goals met: 0 of 20
23. (unload-truck p7 t0 l0-2)
   deleted: (in p7 t0)
   added: (at p7 l0-2)
   goals met: 1 of 20
24. (load-truck p19 t4 l4-3)
   deleted: (at p19 l4-3)
   added: (in p19 t4)
   goals met: 1 of 20
25. (load-truck p14 t4 l4-3)
   deleted: (at p14 l4-3)
   added: (in p14 t4)
   goals met: 1 of 20
26. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 1 of 20
27. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 20
28. (drive-truck t3 l3-0 l3-1 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-1)
   goals met: 1 of 20
29. (drive-truck t0 l0-2 l0-1 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-1)
   goals met: 1 of 20
30. (unload-truck p6 t2 l2-0)
   deleted: (in p6 t2)
   added: (at p6 l2-0)
   goals met: 1 of 20
31. (unload-truck p10 t2 l2-0)
   deleted: (in p10 t2)
   added: (at p10 l2-0)
   goals met: 1 of 20
32. (load-truck p9 t2 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 t2)
   goals met: 1 of 20
33. (unload-truck p3 t1 l1-0)
   deleted: (in p3 t1)
   added: (at p3 l1-0)
   goals met: 1 of 20
34. (unload-truck p17 t1 l1-0)
   deleted: (in p17 t1)
   added: (at p17 l1-0)
   goals met: 1 of 20
35. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 1 of 20
36. (unload-truck p8 t3 l3-1)
   deleted: (in p8 t3)
   added: (at p8 l3-1)
   goals met: 2 of 20
37. (drive-truck t4 l4-3 l4-0 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-0)
   goals met: 2 of 20
38. (load-airplane p5 a2 l4-0)
   deleted: (at p5 l4-0)
   added: (in p5 a2)
   goals met: 2 of 20
39. (load-truck p2 t0 l0-1)
   deleted: (at p2 l0-1)
   added: (in p2 t0)
   goals met: 2 of 20
40. (drive-truck t3 l3-1 l3-3 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-3)
   goals met: 2 of 20
41. (unload-truck p19 t4 l4-0)
   deleted: (in p19 t4)
   added: (at p19 l4-0)
   goals met: 2 of 20
42. (unload-truck p15 t4 l4-0)
   deleted: (in p15 t4)
   added: (at p15 l4-0)
   goals met: 2 of 20
43. (unload-truck p14 t4 l4-0)
   deleted: (in p14 t4)
   added: (at p14 l4-0)
   goals met: 2 of 20
44. (unload-truck p1 t4 l4-0)
   deleted: (in p1 t4)
   added: (at p1 l4-0)
   goals met: 2 of 20
45. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 2 of 20
46. (load-airplane p6 a1 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a1)
   goals met: 2 of 20
47. (load-airplane p10 a1 l2-0)
   deleted: (at p10 l2-0)
   added: (in p10 a1)
   goals met: 2 of 20
48. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 2 of 20
49. (unload-truck p9 t2 l2-2)
   deleted: (in p9 t2)
   added: (at p9 l2-2)
   goals met: 3 of 20
50. (drive-truck t3 l3-3 l3-0 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-0)
   goals met: 3 of 20
51. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 3 of 20
52. (load-airplane p19 a2 l4-0)
   deleted: (at p19 l4-0)
   added: (in p19 a2)
   goals met: 3 of 20
53. (load-airplane p15 a2 l4-0)
   deleted: (at p15 l4-0)
   added: (in p15 a2)
   goals met: 3 of 20
54. (load-airplane p14 a2 l4-0)
   deleted: (at p14 l4-0)
   added: (in p14 a2)
   goals met: 3 of 20
55. (load-airplane p1 a2 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 a2)
   goals met: 3 of 20
56. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 3 of 20
57. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 3 of 20
58. (unload-truck p11 t0 l0-0)
   deleted: (in p11 t0)
   added: (at p11 l0-0)
   goals met: 3 of 20
59. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 3 of 20
60. (unload-airplane p10 a1 l1-0)
   deleted: (in p10 a1)
   added: (at p10 l1-0)
   goals met: 3 of 20
61. (fly-airplane a2 l4-0 l3-0)
   deleted: (at a2 l4-0)
   added: (at a2 l3-0)
   goals met: 3 of 20
62. (load-airplane p4 a0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 3 of 20
63. (load-airplane p2 a0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a0)
   goals met: 3 of 20
64. (load-airplane p11 a0 l0-0)
   deleted: (at p11 l0-0)
   added: (in p11 a0)
   goals met: 3 of 20
65. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 3 of 20
66. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 3 of 20
67. (load-truck p10 t1 l1-0)
   deleted: (at p10 l1-0)
   added: (in p10 t1)
   goals met: 3 of 20
68. (unload-airplane p5 a2 l3-0)
   deleted: (in p5 a2)
   added: (at p5 l3-0)
   goals met: 4 of 20
69. (load-airplane p13 a2 l3-0)
   deleted: (at p13 l3-0)
   added: (in p13 a2)
   goals met: 4 of 20
70. (load-airplane p12 a2 l3-0)
   deleted: (at p12 l3-0)
   added: (in p12 a2)
   goals met: 4 of 20
71. (fly-airplane a0 l0-0 l3-0)
   deleted: (at a0 l0-0)
   added: (at a0 l3-0)
   goals met: 4 of 20
72. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 4 of 20
73. (unload-airplane p6 a1 l0-0)
   deleted: (in p6 a1)
   added: (at p6 l0-0)
   goals met: 5 of 20
74. (fly-airplane a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 5 of 20
75. (unload-airplane p2 a0 l3-0)
   deleted: (in p2 a0)
   added: (at p2 l3-0)
   goals met: 5 of 20
76. (unload-airplane p11 a0 l3-0)
   deleted: (in p11 a0)
   added: (at p11 l3-0)
   goals met: 6 of 20
77. (unload-truck p10 t1 l1-1)
   deleted: (in p10 t1)
   added: (at p10 l1-1)
   goals met: 7 of 20
78. (load-airplane p3 a2 l1-0)
   deleted: (at p3 l1-0)
   added: (in p3 a2)
   goals met: 7 of 20
79. (load-airplane p17 a2 l1-0)
   deleted: (at p17 l1-0)
   added: (in p17 a2)
   goals met: 7 of 20
80. (load-airplane p16 a2 l1-0)
   deleted: (at p16 l1-0)
   added: (in p16 a2)
   goals met: 7 of 20
81. (load-airplane p0 a2 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a2)
   goals met: 7 of 20
82. (fly-airplane a0 l3-0 l2-0)
   deleted: (at a0 l3-0)
   added: (at a0 l2-0)
   goals met: 7 of 20
83. (fly-airplane a2 l1-0 l4-0)
   deleted: (at a2 l1-0)
   added: (at a2 l4-0)
   goals met: 7 of 20
84. (load-truck p2 t3 l3-0)
   deleted: (at p2 l3-0)
   added: (in p2 t3)
   goals met: 7 of 20
85. (unload-airplane p4 a0 l2-0)
   deleted: (in p4 a0)
   added: (at p4 l2-0)
   goals met: 7 of 20
86. (drive-truck t3 l3-0 l3-3 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-3)
   goals met: 7 of 20
87. (unload-airplane p3 a2 l4-0)
   deleted: (in p3 a2)
   added: (at p3 l4-0)
   goals met: 8 of 20
88. (unload-airplane p12 a2 l4-0)
   deleted: (in p12 a2)
   added: (at p12 l4-0)
   goals met: 9 of 20
89. (unload-airplane p0 a2 l4-0)
   deleted: (in p0 a2)
   added: (at p0 l4-0)
   goals met: 9 of 20
90. (unload-truck p2 t3 l3-3)
   deleted: (in p2 t3)
   added: (at p2 l3-3)
   goals met: 10 of 20
91. (load-truck p4 t2 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 t2)
   goals met: 10 of 20
92. (fly-airplane a2 l4-0 l2-0)
   deleted: (at a2 l4-0)
   added: (at a2 l2-0)
   goals met: 10 of 20
93. (load-truck p0 t4 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 t4)
   goals met: 10 of 20
94. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 10 of 20
95. (unload-airplane p19 a2 l2-0)
   deleted: (in p19 a2)
   added: (at p19 l2-0)
   goals met: 10 of 20
96. (unload-airplane p16 a2 l2-0)
   deleted: (in p16 a2)
   added: (at p16 l2-0)
   goals met: 10 of 20
97. (unload-airplane p13 a2 l2-0)
   deleted: (in p13 a2)
   added: (at p13 l2-0)
   goals met: 10 of 20
98. (drive-truck t4 l4-0 l4-3 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-3)
   goals met: 10 of 20
99. (unload-airplane p18 a2 l2-0)
   deleted: (in p18 a2)
   added: (at p18 l2-0)
   goals met: 11 of 20
100. (unload-airplane p15 a2 l2-0)
   deleted: (in p15 a2)
   added: (at p15 l2-0)
   goals met: 12 of 20
101. (unload-airplane p14 a2 l2-0)
   deleted: (in p14 a2)
   added: (at p14 l2-0)
   goals met: 13 of 20
102. (unload-truck p4 t2 l2-1)
   deleted: (in p4 t2)
   added: (at p4 l2-1)
   goals met: 14 of 20
103. (fly-airplane a2 l2-0 l0-0)
   deleted: (at a2 l2-0)
   added: (at a2 l0-0)
   goals met: 14 of 20
104. (unload-truck p0 t4 l4-3)
   deleted: (in p0 t4)
   added: (at p0 l4-3)
   goals met: 15 of 20
105. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 15 of 20
106. (unload-airplane p17 a2 l0-0)
   deleted: (in p17 a2)
   added: (at p17 l0-0)
   goals met: 16 of 20
107. (unload-airplane p1 a2 l0-0)
   deleted: (in p1 a2)
   added: (at p1 l0-0)
   goals met: 17 of 20
108. (load-truck p19 t2 l2-0)
   deleted: (at p19 l2-0)
   added: (in p19 t2)
   goals met: 17 of 20
109. (load-truck p16 t2 l2-0)
   deleted: (at p16 l2-0)
   added: (in p16 t2)
   goals met: 17 of 20
110. (load-truck p13 t2 l2-0)
   deleted: (at p13 l2-0)
   added: (in p13 t2)
   goals met: 17 of 20
111. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 17 of 20
112. (unload-truck p19 t2 l2-3)
   deleted: (in p19 t2)
   added: (at p19 l2-3)
   goals met: 18 of 20
113. (unload-truck p16 t2 l2-3)
   deleted: (in p16 t2)
   added: (at p16 l2-3)
   goals met: 19 of 20
114. (unload-truck p13 t2 l2-3)
   deleted: (in p13 t2)
   added: (at p13 l2-3)
   goals met: 20 of 20
